package API;						// 라이브러리(library)라고 부르며, 자주 사용되는 클래스 및 인터페이스의 모음
									// API도큐먼트는 쉽게 API를 찾아 이용할 수 있도록 문서화한 것.
									//API도큐먼트의 왼쪽 상단은 패키지 전체 목록,
									//API도큐먼트의 왼쪽 하단은 패키지에 속하는 클래스와 인터페이스 목록
									//중앙 프레임에는 선택한 클래스나 인터페이스에 대한 상세설명
									//클래스 선택후 F1키를 누르면 바로 도큐먼트 확인가능

import java.lang.*;				//기본으로 패키지에 속하기 때문에 추가해줄 필요가 없음.

public class API_Mean extends Object {		//상속을 하지 않아도 모든 클래스는 Object에 상속.
	public static void main(String[] args) {		// Object 는 메소드 들로 구성이 되어있고, 모든 클래스에서 사용가능.
									/*
									 -----------------java.lang 패키지 --------------------- 
									 
									class
									object       -  자바 클래스의 최상위 클래스로 사용
									
									System	  -  표준 입력 장치(키보드)로부터 데이터를 입력받을 때 사용
												  -  표준 출력 장치(모니터)로 출력하기 위해 사용
												  -  자바 가상 기계를 종료시킬 때 사용
												  -  쓰레기 수집기를 실행 요청 할 때 사용
												 
									Class		  -  클래스를 메모리로 로딩할 때 사용
									
									String		  -  문자열을 저장하고 여러 가지 정보를 얻을 때 사용
									
									StringBuffer,
									StringBuilder - 문자열을 저장하고 내부 문자열을 조작할 때 사용
									
									Math		  -  수학 함수를 이용할 때 사용
									
									Wrapper	  -  기본 타입의 데이터를 갖는 객체를 만들 때 사용
												  -  문자열을 기본 타입으로 변환할 때 사용
												  -  입력값 검사에 사용
												  
												  
									--------------- java.util 패키지 --------------------------
									class
									Arrays		  -  배열을 조작(비교, 복사, 정렬, 찾기)할 때 사용
									Calendar	  -  운영체제의 날짜와 시간을 얻을 때 사용
									Date		  -  날짜와 시간 정보를 저장하는 클래스
									Objects	  -  객체 비교, 널(null) 여부 등을 조사할 때 사용
									StringTokenizer - 특정 문자로 구분된 문자열을 뽑아낼 때 사용
									Random	  -  난수를 얻을 때 사용
									
									
									*/
		
		
		
		
		
	}
}
